In [168]:
import pandas as pd

In [305]:
df = pd.read_csv("tested.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [306]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked','Fare'],axis='columns',inplace=True)

In [307]:
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  34.5
1         1       3  female  47.0
2         0       2    male  62.0
3         0       3    male  27.0
4         1       3  female  22.0

In [308]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [309]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [310]:
inputs.Age[:11]

0     34.5
1     47.0
2     62.0
3     27.0
4     22.0
5     14.0
6     30.0
7     26.0
8     18.0
9     21.0
10     NaN
Name: Age, dtype: float64

In [311]:
inputs.Age = inputs.Age.fillna(inputs.Age.median())

In [312]:
inputs[:11]

    Pclass  Sex   Age
0        3    1  34.5
1        3    2  47.0
2        2    1  62.0
3        3    1  27.0
4        3    2  22.0
5        3    1  14.0
6        3    2  30.0
7        2    1  26.0
8        3    2  18.0
9        3    1  21.0
10       3    1  27.0

In [313]:
from sklearn.model_selection import train_test_split

In [318]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [319]:
len(X_train)

334

In [320]:
len(X_test)

84

In [321]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [322]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [323]:
model.score(X_test,y_test)

1.0